src/Catalogs/Кассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Кассы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеСписаниеМатериалов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтСдачаВыемкиПриЗакрытииСмены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьПечатьЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФФДдляККТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнееОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыемкаИзКассы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершатьАвтоматическиОперацииВемкиВнесения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезПодключенияОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаДляСдачиВыручки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМКласс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККММарка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМНомерПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМНомерРегистрационный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМТип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередаватьДолжность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьКопииЧеков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьКопииЧековКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКассира</Name>
					<Comment>0 - "Фамилия Имя Отчество"1. "Фамилия Имя"2. "Фамилия И.О."3. "Фамилия И."4. "Фамилия"</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетЭлектронногоЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКассы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКасс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматТелефонногоНомераДляОтправкиЭлектронныхЧековККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйЧекEmailПередаютсяПрограммой1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйЧекSMSПередаютсяПрограммой1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Секции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СегментНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыОплат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПробиватьНефискальныйЧек</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИспользовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭквайринговыеТерминалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭквайринговыйТерминал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыКасс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКасс</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КассаПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперационнаяКасса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Comment>Денежные средства на лицевом счете</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводыВПути</Name>
					<Comment>Для фин. операций передачи денег из организации в банк</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
					<Comment>Для СБП и ссылок на оплату</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыЭквайринговыхТерминалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыЭквайринговыхТерминалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Онлайн</Name>
					<Comment>Интернет эквайринг без терминала</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торговый</Name>
					<Comment>Физический терминал в торговой точке</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Кассы/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Процедура, Обработчик события "ПриКопировании"
//
Процедура ПриКопировании(ОбъектКопирования)
	
	Организация        = Неопределено;
	СтруктурнаяЕдиница = Неопределено;
	Наименование       = "";
	КодСинхронизации   = "";
	
КонецПроцедуры

// Обработчик заполнения объекта внешними данными
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	ЭтотОбъект.ТипКассы = Перечисления.ТипыКасс.ОперационнаяКасса;    
				
	Если ЭтоНовый() Тогда			
		// Заполнение ТБ доступных видов оплат чека ККМ
		ЗапросВидовОплат = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТипыОплат.Ссылка КАК ВидОплаты,
		|	ВЫБОР
		|		КОГДА ТипыОплат.Ссылка = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ЛицевойСчет)
		|				ИЛИ ТипыОплат.Ссылка = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ПодарочныйСертификат)
		|				ИЛИ ТипыОплат.Ссылка = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Аванс)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПробиватьНефискальныйЧек
		|ИЗ
		|	Перечисление.ТипыДенежныхСредств КАК ТипыОплат
		|ГДЕ
		|	ТипыОплат.Ссылка <> ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхсредств.Безналичные)
		|	И ТипыОплат.Ссылка <> ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхсредств.ПереводыВПути)
		|	И ТипыОплат.Ссылка <> ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхсредств.СистемаБыстрыхПлатежей)");
		
		ЭтотОбъект.ВидыОплат.Загрузить(ЗапросВидовОплат.Выполнить().Выгрузить());		
		
		ЭтотОбъект.ВыемкаИзКассы = Перечисления.ВидыОпераций.СдачаРозничнойВыручкиВКассуПредприятия;
	КонецЕсли;          
	
КонецПроцедуры

// Обработчик перед записью объекта на сервер
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВнешнееОборудование)
		И ИспользоватьБезПодключенияОборудования = Ложь Тогда
		
		ИспользоватьБезПодключенияОборудования = Истина;
	КонецЕсли;
	
	МассивСтрокТЧ = ЭквайринговыеТерминалы.НайтиСтроки(Новый Структура("ЭквайринговыйТерминал", Справочники.ЭквайринговыеТерминалы.ПустаяСсылка()));	
	Для Каждого СтрокаТЧ Из МассивСтрокТЧ Цикл
		ЭквайринговыеТерминалы.Удалить(СтрокаТЧ);							
	КонецЦикла;
	
	СтрокаТЧ = Неопределено;
	Если ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда				
		
		СтрокаТЧ = ЭквайринговыеТерминалы.Найти(ЭквайринговыйТерминал);	
		
		Если СтрокаТЧ = Неопределено Тогда
			СтрокаТЧ = ЭквайринговыеТерминалы.Добавить();
			СтрокаТЧ.ЭквайринговыйТерминал = ЭквайринговыйТерминал;
		КонецЕсли;
		
		Для Каждого СтрокаТ Из ЭквайринговыеТерминалы Цикл // Переопределяем признак основной всем эквайринговым терминалам на всякий случай
			СтрокаТ.Основной = СтрокаТ = СтрокаТЧ;
		КонецЦикла;
		
	Иначе
		
		ОсновнойЭТ = ЭквайринговыеТерминалы.Найти(Истина, "Основной");
		
		Если ОсновнойЭТ = Неопределено Тогда
			Для Каждого СтрокаТ Из ЭквайринговыеТерминалы Цикл
				Если СтрокаТ.ЭквайринговыйТерминал.ТипЭквайринга = Перечисления.ТипыЭквайринговыхТерминалов.Торговый Тогда
					СтрокаТ.Основной = Истина;
					ЭквайринговыйТерминал = СтрокаТ.ЭквайринговыйТерминал;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ЭквайринговыйТерминал = ОсновнойЭТ.ЭквайринговыйТерминал;	
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

// Обработчик проверки заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)           
	
	Если ЭтоГруппа = Ложь И ТипКассы = Перечисления.ТипыКасс.КассаПредприятия Тогда
		
		 ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Склад"));

	КонецЕсли;	

КонецПроцедуры

#КонецОбласти
